import streamlit as st

st.markdown(
    """
    <style>
    @import url('https://fonts.googleapis.com/css2?family=Vazirmatn:wght@400;700&display=swap');
    .persian-text {
        font-family: 'Vazirmatn', sans-serif;
        direction: rtl;
        text-align: right;
        }
    </style>
    """,
    unsafe_allow_html=True
    )
st.markdown(
    """
    <style>
    @import url('https://fonts.googleapis.com/css2?family=Vazirmatn:wght@400;700&display=swap');
    .persian-titr1 {
        font-family: 'Vazirmatn', sans-serif;
        direction: rtl;
        text-align: right;
        color: red;
        }
    </style>
    """,
    unsafe_allow_html=True
    )
st.markdown(
    """
    <style>
    @import url('https://fonts.googleapis.com/css2?family=Vazirmatn:wght@400;700&display=swap');
    .persian-titr2 {
        font-family: 'Vazirmatn', sans-serif;
        direction: rtl;
        text-align: right;
        color: blue;
        }
    </style>
    """,
    unsafe_allow_html=True
    )


col1, col2 = st.columns(2)
col1.page_link(label= "**صفحه سلطانیه در وبسایت یونسکو**", 
             page="https://whc.unesco.org/en/list/1188/", icon=":material/home:")
col1.page_link(label= "**وبسایت شهرداری سلطانیه**",
               page = "https://www.soltaniyeh.ir/", icon= ":material/villa:")
col2.page_link(label = "**وبسایت اداره کل راه و شهرسازی استان زنجان**",
                page= "https://zanjan.mrud.ir/", icon=":material/forum:")
col2.page_link(label="**وبسایت اداره کل میراث فرهنگی، گردشگری و صنایع دستی استان زنجان**",
               page="https://zanjan.mcth.ir/", icon=":material/castle:")

st.markdown('<p class="persian-titr1">پیش گفتار</p>', unsafe_allow_html=True)
text = st.write('<p class="persian-text">محوطه سلطانیه با گنبد و بناهای تاریخی چشمگیرش، نمونه ‌ای برجسته از استفاده انسان از محیط مساعد را نشان می ‌دهد. علاوه بر این، این بنا گواهی نمونه از دستاوردی مهم در مسیر نوآوری‌ های معماری بشر است. علیرغم این واقعیت که جذابیت انسان برای مراتع سرسبز سلطانیه، که با مراتع وسیع و حاصلخیز آن نمایان می ‌شود، به دوران ماقبل تاریخ برمی‌گردد، در قرن هشتم هجری (چهاردهم میلادی) بود که این مراتع برای تبدیل شدن به پایتخت یک امپراتوری انتخاب شد. ایلخان مغول اولجایتو، که اخیراً به شیعه گرویده بود (و نام سلطان محمد خدابنده را برای خود انتخاب کرده بود)، تصمیم گرفت پایتخت خود را با بنایی عظیم که آرامگاه او باشد، بسازد. این مکان ‌ها نمونه ‌ای از وحدت موفق بین شیوه زندگی مغول‌ ها، یعنی پرورش اسب و شیوه عشایری، و جامعه یکجانشینی رایج در ایران را نشان می ‌دهند. ساخت سریع اما به طرز شگفت ‌آوری موفقیت ‌آمیز مقبره و سازه‌ های شهر در مدت زمانی کمتر از ده سال (از حدود 704 تا 713 هجری برابر با ۱۳۰۵ تا ۱۳۱۳ میلادی) نقطه اوجی در تاریخ معماری ایرانی بود. بنای مرکزی سلطانیه به عنوان مقبره ایلخان اولجایتو در مجاورت چراگاه ساخته شد. این مقبره با گنبد آجری عظیمی که به زودی نام خود را به کل بنا داد، سر به فلک کشید. این بنای تاریخی امروزه با نام گنبد سلطانیه شناخته می ‌شود. وجود بلندترین گنبدی که تاکنون بر روی یک نقشه هشت ضلعی در سلطانیه ساخته شده است، که صرفاً با ساخت هوشمندانه یک سازه دو پوسته امکان‌پذیر شد، نوآوری ‌ای را نشان می‌دهد که الهام ‌بخش ساخت گنبد بلند سانتا ماریا دل فیوره در فلورانس تقریباً یک قرن بعد شد. جنبه مهم دیگر مقبره اولجایتو، تزئینات داخلی چشمگیر آن به شکل کاشی ‌های لعاب‌دار، آجرکاری، خاتم‌ کاری، گچ‌ بری و نقاشی ‌های دیواری است. مساحت تزئینات این بنای تاریخی ۹۰۰۰ متر مربع تخمین زده شده است و یکی از پر تزئین‌ ترین بناهای تاریخی ایران است. به این ترتیب، این بنای تاریخی یک موزه غنی از هنرهای تزئینی کاربردی و کاربرد آنها در معماری است. اهمیت معنوی این مقبره با طرح‌ های تزئینی و خوشنویسی فراوان آن آشکار می ‌شود که نشان از دلبستگی سازنده به مذهب تشیع دارد. طبق یک روایت، این بنای تاریخی در ابتدا برای نگهداری یادگارهای امامان شیعه، امام علی و پسرش امام حسین (ع)، طراحی شده بود. این مکان در دشتی در مجاورت مراتعی قرار دارد که دلیل اصلی ایجاد و وجود آن بوده است. کل منطقه در یک منطقه حائل منظر وسیع (۴۵۴۷.۳۸ هکتار) قرار دارد که شامل بناهای تاریخی با هسته و مناطق حریم آنها می ‌شود. منطقه حریم شامل دو منطقه اصلی است: مناطق حریم درجه یک و درجه دوی گنبد سلطانیه و یک منطقه حریم منظری واحد که کل مجموعه را در به همراه شهر و اراضی اطراف در بر می گیرد.</p>', 
                unsafe_allow_html=True)

col1 , col2 = st.columns(2)
col1.image("Soltaniyeh_Heritag_Sites.png")
col2.image("Heritage_Official_Map.jpg")

