import streamlit as st



st.markdown(
    """
    <style>
    @import url('https://fonts.googleapis.com/css2?family=Vazirmatn:wght@400;700&display=swap');
    .persian-text {
        font-family: 'Vazirmatn', sans-serif;
        direction: rtl;
        text-align: right;
        }
    </style>
    """,
    unsafe_allow_html=True
    )
st.markdown(
    """
    <style>
    @import url('https://fonts.googleapis.com/css2?family=Vazirmatn:wght@400;700&display=swap');
    .persian-titr1 {
        font-family: 'Vazirmatn', sans-serif;
        direction: rtl;
        text-align: right;
        color: red;
        }
    </style>
    """,
    unsafe_allow_html=True
    )
st.markdown(
    """
    <style>
    @import url('https://fonts.googleapis.com/css2?family=Vazirmatn:wght@400;700&display=swap');
    .persian-titr2 {
        font-family: 'Vazirmatn', sans-serif;
        direction: rtl;
        text-align: right;
        color: blue;
        }
    </style>
    """,
    unsafe_allow_html=True
    )

st.image("Applicationtitr.jpg", width=400)
st.markdown('<p class="persian-titr1">درباره اپلیکیشن</p>', unsafe_allow_html=True)

st.markdown('<p class="persian-text">اپلیکیشن جامع طرح ویژه سلطانیه 1420 (CASSP) مهمترین نتایج فرآیند برنامه‌ریزی شهری انجام شده توسط مهندسین مشاور پرداراز بین سال‌های 1400 تا 1404 را ارائه می‌دهد. بی شک بدون کمک سازمان‌های مختلف دولتی، سازمان های مردم نهاد و ساکنان شهر، پیشرفت مطالعات و دستیابی به نتایج قابل اتکا ممکن نبود. مطالب ارائه شده توسط این برنامه شامل وضعیت فعلی است که ویژگی‌های سلطانیه را در سال‌های 1400 و 1401 نشان می‌دهد، برنامه راهبردی زنجیره نتایج برنامه‌ریزی استراتژیک را از بیانیه چشم‌انداز تا برنامه‌های عملیاتی ارائه می‌دهد، و نقشه تعاملی سلطانیه که امکان بازدید از نتایج مرتبط با نقشه، مانند مکان سایت‌های میراثی، پهنه‌بندی، کاربری اراضی و غیره را فراهم می‌کند.</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">پیش از بخش‌های اصلی این اپلیکیشن، خلاصه‌ای از اهمیت سلطانیه را به عنوان یک میراث جهانی ارائه می‌دهد. این بخش شامل داستان سلطانیه - از اولجایتو تا کنون -، نقشه مکان‌های میراث، جدولی در مورد ویژگی‌های آنها و خلاصه‌ای در مورد نحوه حفاظت از آنها است.</p>', unsafe_allow_html=True)

":orange[----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------]"
st.markdown('<p class="persian-titr1">اهداف اپلیکیشن</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">اهداف اصلی از طراحی و راه اندازی این اپلیکیشن شامل موارد زیر است:</p>',
            unsafe_allow_html=True)
st.markdown('<p class="persian-text">معرفی طرح ویژه سلطانیه 1420 و نتایج و پیامدهای اصلی آن برای طیف وسیعی از کاربران.</p>',
            unsafe_allow_html=True)
st.markdown('<p class="persian-text">آگاه سازی مردم – به ویژه ساکنان سلطانیه - و ایجاد امکان مطالبه گری از مسئولین و بخش ‌های مربوطه در مورد وظایف جاری و آینده.</p>',
            unsafe_allow_html=True)
st.markdown('<p class="persian-text">ارائه یک اپلیکیشن کاربردی برای مقایسه وضعیت فعلی و قبلی به منظور تصمیم‌گیری ‌های مناسب برای آینده.</p>',
            unsafe_allow_html=True)
st.markdown('<p class="persian-text">افزایش آگاهی مردم در مورد میراث فرهنگی و امکانات آن برای بهبود وضعیت اجتماعی-اقتصادی خود.</p>',
            unsafe_allow_html=True)
st.markdown('<p class="persian-text">کمک به محققان مختلف در مورد سلطانیه (از تاریخ آن گرفته تا طبیعت اطراف آن) برای یافتن آسان اطلاعات مرتبط.</p>',
            unsafe_allow_html=True)
st.markdown('<p class="persian-text">هدایت بهتر پروژه‌های محلی به سمت انطباق با طرح ویژه سلطانیه 1420.</p>',
            unsafe_allow_html=True)



":orange[----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------]"
st.markdown('<p class="persian-titr1">بهره برداران و کاربران</p>', unsafe_allow_html=True)
st.write('<p class="persian-titr2">ساکنان شهر سلطانیه</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">از آنجا که این برنامه شفافیت در برنامه های ناظر بر توسعه شهر را به ارمغان می آورد و به آنها این امکان را می‌دهد که از مدیریت شهری در مورد نتایج، پیشرفت‌ها و وظایف در حال انجام مطالبه گری کنند.</p>',
            unsafe_allow_html=True)
st.write('<p class="persian-titr2">مرمتگران و حافظان میراث فرهنگی</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">در کنار اسناد رسمی و مجموعه‌های مختلف مقررات در مورد اصول حاکم بر نحوه مرمت بناهای تاریخی و حفاظت از آنها، CASSP می‌تواند به عنوان بایگانی و هماهنگ‌کننده بین تمام فعالیت‌هایی که باید انجام شود، ایفای نقش کند. این برنامه می‌تواند به عنوان یک گالری جامع برای نشان دادن اینکه چگونه حتی یک تغییر کوچک در یک بنای تاریخی می‌تواند به کل طرح در رسیدن به اهدافش کمک کند، مورد استفاده قرار گیرد.</p>',
            unsafe_allow_html=True)
st.write('<p class="persian-titr2">شهرداری سلطانیه</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">شهرداری به عنوان بخش اصلی مدیریت شهری، باید از جدیدترین و دقیق‌ترین برنامه‌ها برای آینده مطلع شود. این برنامه می‌تواند به آنها هشدار دهد تا در صورت لزوم، روال‌های خود را با وظایف پیش رو و اهداف بلندمدت تنظیم کنند.</p>',
            unsafe_allow_html=True)
st.write('<p class="persian-titr2">سرمایه گذاران</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">بدون سرمایه‌گذاری در پروژه‌های پیشنهادی، اهداف طرح ویژه قابل دستیابی نیستند. CASSP اطلاعات ارزشمندی در مورد جنبه‌های مختلف این پروژه‌ها برای سرمایه‌گذاران فراهم می‌کند و همچنین به آنها کمک می‌کند تا فرصت‌های جدیدی برای سرمایه‌گذاری در سلطانیه و اطراف آن خلق کنند.</p>',
            unsafe_allow_html=True)
st.write('<p class="persian-titr2">سازمان های مردم نهاد (NGOs)</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">سازمان‌های مردم نهاد، به‌ویژه آن‌هایی که به حفاظت از بناها و محوطه‌های تاریخی، مطالعات زیست‌محیطی، توسعه پایدار، صنعت گردشگری و غیره علاقه‌مند هستند، می‌توانند اطلاعات زیادی از این منبع دریافت کنند. آن‌ها با استفاده از CASSP می‌توانند به راحتی برنامه و پیامدهای آن را بررسی کنند، نه تنها برای آگاه کردن مدیریت شهری از نیازهای برآورده نشده، بلکه برای تجهیز آن‌ها به انتخاب‌های عاقلانه.</p>',
            unsafe_allow_html=True)
st.write('<p class="persian-titr2">یونسکو</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">همانطور که در پرونده سلطانیه به وضوح ذکر شده است: "...هنگام انجام پروژه‌های حفاظت و مرمت، رعایت مداوم استانداردهای علمی و حفاظت مناسب از بنای تاریخی ضروری است". CASSP اطلاعات اساسی در مورد برنامه‌های آینده را با تعاریف واضح از جنبه‌های مختلف طرح ویژه سلطانیه ارائه می‌دهد. مأموران یونسکو می‌توانند تأثیرات این برنامه را بر بناهای تاریخی بررسی کنند تا از وقوع اشتباهات [ناخواسته] جلوگیری کنند.</p>',
            unsafe_allow_html=True)
st.write('<p class="persian-titr2">محققان و پژوهشگران</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">مانند سازمان‌های مردم نهاد، محققان تاریخ، محیط زیست، هنر و مصنوعات دستی و غیره می‌توانند اطلاعات زیادی در مورد این برنامه پیدا کنند. بر اساس حوزه مورد علاقه، به عنوان مثال، وضعیت فعلی می‌تواند به جامعه‌شناسان در مطالعه جامعه سلطانیه یا جغرافی‌دانان در انجام تحقیقات در مورد پوشش زمین در شهرستان سلطانیه کمک کند.</p>',
            unsafe_allow_html=True)
st.write('<p class="persian-titr2">گردشگران</p>', unsafe_allow_html=True)
st.markdown('<p class="persian-text">بازدیدکنندگان سلطانیه می‌توانند از قبل در مورد موقعیت مکانی، اهمیت این مکان، زیرساخت‌های گردشگری، فاصله آن با سایر مقاصد و غیره مطلع شوند. اگرچه CASSP بر طرح ویژه سلطانیه 1420 تمرکز دارد، اما شامل اطلاعات ارزشمندی در مورد مقاصد گردشگری اطراف سلطانیه نیز می‌شود.</p>',
            unsafe_allow_html=True)





